Show / Hide Table of Contents
Class CheckResSummary
Check summary
Inheritance
System.Object
CheckResSummary
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
[Serializable]
[DataContract]
public class CheckResSummary
Properties
Improve this Doc   View Source
CheckStatus
Status of check
Declaration
[DataMember]
public bool CheckStatus { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
CheckValue
Check value
Declaration
[DataMember]
public double CheckValue { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
LoadCaseId
Id of Load Case
Declaration
[Obsolete]
[DataMember]
public int LoadCaseId { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Name
Name
Declaration
[DataMember]
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
UnityCheckMessage
Detail message about overall check
Declaration
[DataMember]
public string UnityCheckMessage { get; set; }
Property Value
 Type |  Description
 System.String
 Improve this Doc
 View Source